cy-rhino/ArduinoCore-stm32l0/boards.txt
menu.usb=USB Type
menu.dosfs=DOSFS
menu.speed=CPU Speed
menu.opt=Optimize

##############################################################

# Cyrola Rhino WAN
# ---------------------------------------
Rhino-WAN-L082CZ.name=Rhino-WAN-L082CZ
Rhino-WAN-L082CZ.vid.0=0x1209
Rhino-WAN-L082CZ.pid.0=0x6665

Rhino-WAN-L082CZ.upload.tool=stm32l0_dfu
Rhino-WAN-L082CZ.upload.protocol=dfu
Rhino-WAN-L082CZ.upload.maximum_size=196608
Rhino-WAN-L082CZ.upload.maximum_data_size=20480
Rhino-WAN-L082CZ.upload.use_1200bps_touch=true
Rhino-WAN-L082CZ.upload.wait_for_upload_port=false
Rhino-WAN-L082CZ.upload.native_usb=false

Rhino-WAN-L082CZ.build.mcu=cortex-m0plus
Rhino-WAN-L082CZ.build.f_cpu=32000000L
Rhino-WAN-L082CZ.build.board=STM32L0_RHINOWAN
Rhino-WAN-L082CZ.build.arch=stm32l0
Rhino-WAN-L082CZ.build.core=arduino
Rhino-WAN-L082CZ.build.vid=0x1209
Rhino-WAN-L082CZ.build.pid=0x6665
Rhino-WAN-L082CZ.build.did=0xffff
Rhino-WAN-L082CZ.build.usb_manufacturer="Cyrola Inc"
Rhino-WAN-L082CZ.build.usb_product="Rhino WAN"
Rhino-WAN-L082CZ.build.extra_flags=-DSTM32L082xx -march=armv6-m -mthumb -mabi=aapcs -mfloat-abi=soft -fsingle-precision-constant {build.usb_flags} {build.dosfs_flags}
Rhino-WAN-L082CZ.build.ldscript=linker_scripts/STM32L082CZ_FLASH.ld
Rhino-WAN-L082CZ.build.openocdscript=openocd_scripts/Rhino-WAN-L082CZ.cfg
Rhino-WAN-L082CZ.build.variant=Rhino-WAN-L082CZ
Rhino-WAN-L082CZ.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L0xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l082xx -larm_cortexM0l_math
Rhino-WAN-L082CZ.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L0xx/Include" "-I{runtime.platform.path}/system/STM32L0xx/Include" 

Rhino-WAN-L082CZ.menu.usb.cdc=Serial
Rhino-WAN-L082CZ.menu.usb.cdc.build.usb_type=USB_TYPE_CDC
Rhino-WAN-L082CZ.menu.usb.cdc_msc=Serial + Mass Storage
Rhino-WAN-L082CZ.menu.usb.cdc_msc.build.usb_type=USB_TYPE_CDC_MSC
Rhino-WAN-L082CZ.menu.usb.none=No USB
Rhino-WAN-L082CZ.menu.usb.none.build.usb_type=USB_TYPE_NONE

Rhino-WAN-L082CZ.menu.dosfs.none=None
Rhino-WAN-L082CZ.menu.dosfs.none.build.dosfs_sdcard=0
Rhino-WAN-L082CZ.menu.dosfs.none.build.dosfs_sflash=0
Rhino-WAN-L082CZ.menu.dosfs.sdspi=SDCARD (SPI)
Rhino-WAN-L082CZ.menu.dosfs.sdspi.build.dosfs_sdcard=1
Rhino-WAN-L082CZ.menu.dosfs.sdspi.build.dosfs_sflash=0
Rhino-WAN-L082CZ.menu.dosfs.sfspi=SFLASH (SPI)
Rhino-WAN-L082CZ.menu.dosfs.sfspi.build.dosfs_sdcard=0
Rhino-WAN-L082CZ.menu.dosfs.sfspi.build.dosfs_sflash=1

Rhino-WAN-L082CZ.menu.speed.32=32 MHz
Rhino-WAN-L082CZ.menu.speed.32.build.f_cpu=32000000L
Rhino-WAN-L082CZ.menu.speed.16=16 MHz (No USB)
Rhino-WAN-L082CZ.menu.speed.16.build.f_cpu=16000000L
Rhino-WAN-L082CZ.menu.speed.4=4.2 MHz (No USB)
Rhino-WAN-L082CZ.menu.speed.4.build.f_cpu=4200000L

Rhino-WAN-L082CZ.menu.opt.os=Smallest Code
Rhino-WAN-L082CZ.menu.opt.os.build.flags.optimize=-Os
Rhino-WAN-L082CZ.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
Rhino-WAN-L082CZ.menu.opt.o1=Fast
Rhino-WAN-L082CZ.menu.opt.o1.build.flags.optimize=-O1
Rhino-WAN-L082CZ.menu.opt.o1.build.flags.ldspecs=
Rhino-WAN-L082CZ.menu.opt.o2=Faster
Rhino-WAN-L082CZ.menu.opt.o2.build.flags.optimize=-O2
Rhino-WAN-L082CZ.menu.opt.o2.build.flags.ldspecs=
Rhino-WAN-L082CZ.menu.opt.o3=Fastest
Rhino-WAN-L082CZ.menu.opt.o3.build.flags.optimize=-O3
Rhino-WAN-L082CZ.menu.opt.o3.build.flags.ldspecs=


# Tlera Grasshopper
# ---------------------------------------
Grasshopper-L082CZ.name=Grasshopper-L082CZ
Grasshopper-L082CZ.vid.0=0x1209
Grasshopper-L082CZ.pid.0=0x6665

Grasshopper-L082CZ.upload.tool=stm32l0_dfu
Grasshopper-L082CZ.upload.protocol=dfu
Grasshopper-L082CZ.upload.maximum_size=196608
Grasshopper-L082CZ.upload.maximum_data_size=20480
Grasshopper-L082CZ.upload.use_1200bps_touch=true
Grasshopper-L082CZ.upload.wait_for_upload_port=false
Grasshopper-L082CZ.upload.native_usb=false

Grasshopper-L082CZ.build.mcu=cortex-m0plus
Grasshopper-L082CZ.build.f_cpu=32000000L
Grasshopper-L082CZ.build.board=STM32L0_GRASSHOPPER
Grasshopper-L082CZ.build.arch=stm32l0
Grasshopper-L082CZ.build.core=arduino
Grasshopper-L082CZ.build.vid=0x1209
Grasshopper-L082CZ.build.pid=0x6665
Grasshopper-L082CZ.build.did=0xffff
Grasshopper-L082CZ.build.usb_manufacturer="Tlera Corporation"
Grasshopper-L082CZ.build.usb_product="Grasshopper"
Grasshopper-L082CZ.build.extra_flags=-DSTM32L082xx -march=armv6-m -mthumb -mabi=aapcs -mfloat-abi=soft -fsingle-precision-constant {build.usb_flags} {build.dosfs_flags}
Grasshopper-L082CZ.build.ldscript=linker_scripts/STM32L082CZ_FLASH.ld
Grasshopper-L082CZ.build.openocdscript=openocd_scripts/grasshopper-l082cz.cfg
Grasshopper-L082CZ.build.variant=Grasshopper-L082CZ
Grasshopper-L082CZ.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L0xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l082xx -larm_cortexM0l_math
Grasshopper-L082CZ.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L0xx/Include" "-I{runtime.platform.path}/system/STM32L0xx/Include" 

Grasshopper-L082CZ.menu.usb.cdc=Serial
Grasshopper-L082CZ.menu.usb.cdc.build.usb_type=USB_TYPE_CDC
Grasshopper-L082CZ.menu.usb.cdc_msc=Serial + Mass Storage
Grasshopper-L082CZ.menu.usb.cdc_msc.build.usb_type=USB_TYPE_CDC_MSC
Grasshopper-L082CZ.menu.usb.none=No USB
Grasshopper-L082CZ.menu.usb.none.build.usb_type=USB_TYPE_NONE

Grasshopper-L082CZ.menu.dosfs.none=None
Grasshopper-L082CZ.menu.dosfs.none.build.dosfs_sdcard=0
Grasshopper-L082CZ.menu.dosfs.none.build.dosfs_sflash=0
Grasshopper-L082CZ.menu.dosfs.sdspi=SDCARD (SPI)
Grasshopper-L082CZ.menu.dosfs.sdspi.build.dosfs_sdcard=1
Grasshopper-L082CZ.menu.dosfs.sdspi.build.dosfs_sflash=0
Grasshopper-L082CZ.menu.dosfs.sfspi=SFLASH (SPI)
Grasshopper-L082CZ.menu.dosfs.sfspi.build.dosfs_sdcard=0
Grasshopper-L082CZ.menu.dosfs.sfspi.build.dosfs_sflash=1

Grasshopper-L082CZ.menu.speed.32=32 MHz
Grasshopper-L082CZ.menu.speed.32.build.f_cpu=32000000L
Grasshopper-L082CZ.menu.speed.16=16 MHz (No USB)
Grasshopper-L082CZ.menu.speed.16.build.f_cpu=16000000L
Grasshopper-L082CZ.menu.speed.4=4.2 MHz (No USB)
Grasshopper-L082CZ.menu.speed.4.build.f_cpu=4200000L

Grasshopper-L082CZ.menu.opt.os=Smallest Code
Grasshopper-L082CZ.menu.opt.os.build.flags.optimize=-Os
Grasshopper-L082CZ.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
Grasshopper-L082CZ.menu.opt.o1=Fast
Grasshopper-L082CZ.menu.opt.o1.build.flags.optimize=-O1
Grasshopper-L082CZ.menu.opt.o1.build.flags.ldspecs=
Grasshopper-L082CZ.menu.opt.o2=Faster
Grasshopper-L082CZ.menu.opt.o2.build.flags.optimize=-O2
Grasshopper-L082CZ.menu.opt.o2.build.flags.ldspecs=
Grasshopper-L082CZ.menu.opt.o3=Fastest
Grasshopper-L082CZ.menu.opt.o3.build.flags.optimize=-O3
Grasshopper-L082CZ.menu.opt.o3.build.flags.ldspecs=


# Tlera Cricket
# ---------------------------------------
Cricket-L082CZ.name=Cricket-L082CZ
Cricket-L082CZ.vid.0=0x1209
Cricket-L082CZ.pid.0=0x6664

Cricket-L082CZ.upload.tool=stm32l0_dfu
Cricket-L082CZ.upload.protocol=dfu
Cricket-L082CZ.upload.maximum_size=196608
Cricket-L082CZ.upload.maximum_data_size=20480
Cricket-L082CZ.upload.use_1200bps_touch=true
Cricket-L082CZ.upload.wait_for_upload_port=false
Cricket-L082CZ.upload.native_usb=false

